Repository: fdesar/Origami-Ext
Catalog: I18n/locale/*/Origami-Ink.po
Languages: fr

source: ** User's Guide **
fr: ** Manuel Utilisateur **

source: Huzita-Hatori Axiom 6 solver
fr: Résolution de l’axiome 6 de Huzita-Hatori

source: Draw construction
fr: Dessiner la construction

source: Huzita7 solver
fr: Résolution de l’axiome 7 de Huzita-Hatori

source: Angle/Segment N-Section
fr: Division d’un angle ou d’un segment en N-parties égales

source: Advanced
fr: Avancé

source: Huzita-Hatori Axiom 1 solver
fr: Résolution de l’axiome 1 de Huzita-Hatori

source: Input : One single segment made of two distinct points, one for each point P1 and P2. Output : One single guide showing the fold. Note: As the solution is the input segment itself, this extension is merely a joke written only to complete the full set of Hatori-Huzita axioms.
fr: Entrée : un unique segment sélectionné constitué de deux points distincts, un pour chaque point P1 et P2. Sortie : un unique guide indiquant le pli. Note : la pli étant le segment lui-même, cette extension est essentiellement une plaisanterie destinée à compléter l’ensemble des axiomes d’Huzita-Hatori.

source: Huzita4 solver
fr: Résolution de l’axiome 4 de Huzita-Hatori

source: Use
fr: Utiliser

source: Huzita-Hatori axiom 5 statement : Given two points P1 and P2 and a line L1, there is a fold that places P1 onto L1 and passes through P2.
fr: Énoncé de l’axiome 5 de Huzita-Hatori : Étant donnés deux points P1 et P2 et une droite D, il existe un pli plaçant P1 sur D passant par P2.

source: Huzita-Hatori axiom 3 statement : Given two lines L1 and L2, there is a unique fold that places L1 onto L2.
fr: Énoncé de l’axiome 3 de Huzita-Hatori : Étant donnés deux droite L1 et L2, il existe un pli unique plaçant L1 sur L2.

source: Input: One single segment made of six points, first beeing P1, second to third, distincts, delimiting a segment of L1, fourth beeing P2 and fifth to sixth, distinct, delimiting a segment of L2. Point P1 must not be on line L1, same for point P2 and line L2. Output : None to three guides giving the possible folds, if one exists, and optionally, the projection segments of P1 onto L1 and P2 onto L2 and/or the parabolas P1->L1 and P2->L2 computed to get the solutions (it may be helpful to understand why there is no or more than one solution as they will always be drawn if requested). Note 1: only folds projecting both P1 and P2 onto their respective delimited segments of L1 and L2 will be drawn and if there is more than one possible fold, a warning message will be issued to remind you you'll need to remove or ignore the unwanted ones. Note 2: if you choose to draw the projections, you can choose both their color and stroke size.
fr: Entrée : un unique segment sélectionné constitué de six points distincts le premier représentant P1, le second au troisième un segment de D1, le quatrième P2 et le cinquième au sixième un segment de D2. Sortie : de zéro à trois guides indiquant les plis possibles, s’ils existent, et, optionnellement les segments projetés de P1 sur D1 et de P2 sur D2 et/ou les paraboles P1->D1 et P2->D2 calculées permettant de trouver les solutions (ce qui peut-être utile pour comprendre pourquoi aucune ou plus d’une solution sont possible, celle-ci étant toujours dessinée lorsqu’elle est demandée). Note 1 : seuls les plis plaçants P1 sur le segment défini de D1 et P2 sur le segment défini de D2 seront dessinés et s’il existe plus d’un plis possible, un message d’avertissement est issu pour rappeler qu’il faudra supprimer ou ignorer le ou les plis indésirables et leur projections. Note 2 : si vous choisissez de dessiner les projections, vous pouvez choisir la couleur et la taille de leurs traits.

source: Huzita-Hatori axiom 6 statement : Given two points P1 and P2 and two lines L1 and L2, there is a fold that places P1 onto L1 and P2 onto L2.
fr: Énoncé de l’axiome 6 de Huzita-Hatori : Étant donnés deux points P1 et P2 et deux droites D1 et D2, il existe un pli plaçant P1 sur D1 et P2 sur D2.

source: Input: One single segment made of either: - 3 distinct points, first to second, distinct, defining a segment of L1, second to third, distinct, defining a segment of L2. - 4 points, first to second, distinct, defining a segment of L1, third and fourth, distinct, defining a segment of L2. Output: One single guide showing the fold (see note). Note 1: if L1 and L2 intersect inside their defined segments then two folds are possible: a warning message will be issued and two guides will be drawn. Note 2: L1 and L2 can be either parallel or secant.
fr: Entrée : un unique segment sélectionné composé indifféremment de : - 3 points distincts, le premier au second délimitant un segment de D1, le second au troisième un segment de D2. - 4 points, le premier au second, distincts, délimitant un segment de D1, le troisième au quatrième, distincts, délimitant un segment de D2. Sortie : un guide indiquant le pli (voir notes). Note 1 : si D1 et D2 se coupent entre les segment définis, il existe alors deux possibilité : un message d’avertissement sera issu et deux guide seront destinés. Note 2 : les droite D1 et D2 peuvent aussi bien être parallèles que sécantes.

source: Given three crease lines L1, L2, L3 all crossing on point P not located on a raw edge, find the complementary crease line L4 crossing point P that allows the paper to lie flat while simultaneously folding all the creases. If one of the angle L1-L2, L2-L3 or L3-L1 is greater than 180° then there is only one solution, located in the quadrant between the two crease lines that make this angle. Othewise, there are 3 solutions, one between each consecutive crease lines.
fr: Étant données trois ligne de pli L1, L2 et L3 se croisant toutes en un point P n’étant pas situé sur un bord, trouver la ligne de pli complémentaire L4 permettant de plier à plat simultanément les quatre plis. Si un des angles L1-L2, L2-L3 ou L3-L1 est supérieur à 180°, il n’existe alors qu’une seule solution, situé dans le quadrant situé entre les deux ligne faisant cet angle. Sinon, trois solutions sont possibles, une pour chaque intervalle entre deux lignes consécutives.

source: Huzita-Hatori axiom 2 statement : Given two points P1 and P2, there is a unique fold that places P1 onto P2.
fr: Énoncé de l’axiome 2 de Huzita-Hatori : Étant donnés deux points P1 et P2, il existe un pli unique plaçant P1 sur P2.

source: Input: One single segment made of three points, first beeing P1, second to third defining a segment of L1. Output: None or one guide showing the fold, if it exists. Note: if the fold runs outside the defined segment of L1, there will be no solution.
fr: Entrée : un unique segment composé de trois points, le premier étant P1 et les deux suivant définissant un segment de D1. Sortie : zéro ou un guide indiquant le pli, s’il existe. Note : si le pli ne passe pas par le segment défini de D1, il n’y aura pas de solution.

source: Input: One single segment made of four distinct points, first and second beeing respectively P2 and P1, third to fourth defining a segment of L1. Output : None to two guides giving the possible folds, if one exists, and optionally, the projection segments of P1 onto L1 and/or the parabola P1->L1 computed to get the solutions (it may be helpful to understand why there is no or more than one solution as it will always be drawn if requested). Note 1: only folds projecting P1 onto the defined segment of L1 will be draw and if there is more than one possible fold, a warning message will be issued to remind you you'll need to remove or ignore the unwanted one. Note 2: if you choose to draw the projections, you can both choose their color and stroke size.
fr: Entrée : un unique segment sélectionné constitué de quatre points distincts les deux premier représentant respectivement P2 et P1, le troisième et le quatrième délimitant un segment de D1. Sortie : de zéro à deux guides indiquant les plis possibles, s’ils existent, et, optionnellement le ou les segments projetés de P1 sur D1 et/ou la parabole P1->D1 calculée permettant de trouver les solutions (ce qui peut-être utile pour comprendre pourquoi aucune ou plus d’une solution sont possible, celle-ci étant toujours dessinée lorsqu’elle est demandée). Note 1 : seuls les plis plaçants P1 sur le segment défini de D1 seront dessinés et s’il existe plus d’un plis possible, un message d’avertissement est issu pour rappeler qu’il faudra supprimer ou ignorer le pli indésirable et sa projection. Note 2 : si vous choisissez de dessiner les projections, vous pouvez choisir la couleur et la taille de leurs traits.

source: Huzita-Hatori Axiom 2 solver
fr: Résolution de l’axiome 2 de Huzita-Hatori

source: HuzitaHatori Axiom 3 solver
fr: Résolution de l’axiome 3 de Huzita-Hatori

source: Scale
fr: Échelle

source: Input: One single segment made of 5 distinct points, first beeing the crossing point P, next three lying respectively on each of the three creases lines running from it and last one located anywhere in the quadrant in which you wish to get the fold. Output: one guide showing the complementary angle. Note: if there is only one possible solution and it doesn't lie in the requested quadrant, a warning message will be issued and this sole solution will be shown.
fr: Entrée : un unique segment sélectionné constitué de cinq points, le premier représentant le point d’intersection P, les trois suivant étant placés sur chacune des droites D1, D2, D3 qui en partent et le dernier placé n’importe où dans le quadrant ou vous souhaitez obtenir le pli. Sortie : un unique guide représentant l’angle complémentaire L4 Note : si une seule solution existe et qu’elle ne se trouve pas dans le quadrant choisi, un message d’avertissement est issu et l’unique solution sera dessinée.

source: Input: One single segment made of 5 distinct points, first to second delimiting a segment of line L1, third beeing the point P, fourth to fith delimiting a segment of L2. Point P cannot be on line L2. Output: None or one guide, giving the possible fold if it exists and optionally the projection segment of P onto L2 and/or the parabola P->L2 computed to get the solution (it may be helpful to understand why there is no solution as it will always be drawn if requested). Note 1: only folds projecting P onto the delimited segment of L2 and crossing L1 in its delemited segment will be draw. Note 2: if you choose to draw the projection, you can both choose its color and stroke size.
fr: Entrée : un unique segment constitué de cinq points distincts, le premier au second délimitant un segment de D1, le troisième étant le point P, le quatrième et le cinquième éliminant un segment de D2 Sortie : zéro ou un guide indiquant le pli possible, s’il existe, et optionnellement le segment projeté de P sur D2 et/ou la parabole P->D2 calculée permettant de trouver les solutions (ce qui peut-être utile pour comprendre pourquoi aucune solution n’est possible, celle-ci étant toujours dessinée lorsqu’elle est demandée). Note 1 : seuls le pli plaçant P sur le segment défini de D2 et passant par le segment défini de D1 sera dessiné. Note 2 : si vous choisissez de dessiner les projections, vous pouvez choisir la couleur et la taille de leurs traits.

source: Input: one single segment made of either two distinct points defining segment S or three distinct points, first to second to define L1 and second to third to define L2. Output: one to N guides, one per section. Note: for angle N-Section, only applies to the salient side (0-180°) made by the two lines.
fr: Entrée : un unique segment constitué soit de deux points distincts définissant le segment S ou de trois points distincts, le premier au second définissant un segment de la droite D1, le second au troisième un segment de la droite D2. Sortie : un à N guides, un pour chaque division. Note : pour les angles, ceci ne s’applique qu’au côté saillant (0-180°) formé par les deux droites.

source: Sections
fr: Divisions

source: Suppress construction segment
fr: Supprimer le segment de construction

source: Input : One single segment made of two distinct points, one for each point P1 and P2. Output : One single guide showing the fold.
fr: Entrée : un unique segment composé de deux points distincts, un pour chaque point PA et P2. Sortie : un guide indiquant le pli.

source: Draw projections
fr: Dessiner la projection

source: Stroke width
fr: Épaisseur du contour

source: Stroke color
fr: Couleur du contour

source: Huzita-Hatori-Justin axiom 7 statement : Given one point P and two lines L1 and L2, there is a fold that places P onto L1 and is perpendicular to L2.
fr: Énoncé de l’axiome 7 de Huzita-Hatori-Justin : Étant donnés un points P et deux droites D1 et D2, il existe un pli plaçant P sur D1 perpendiculaire à D2.

source: Rabbit-Ear solver
fr: Résolution de l’oreille de lapin

source: Suppress construction segments
fr: Supprimer le segment de construction

source: Huzita-Hatori axiom 4 statement : Given a point P1 and a line L1, there is a unique fold perpendicular to L1 that passes through point P1.
fr: Énoncé de l’axiome 4 de Huzita-Hatori : Étant donnés un point P et une droite D, il existe un pli unique perpendiculaire à D passant par P.

source: Huzita-Hatori axiom 1 statement : Given two points P1 and P2, there is a unique fold that passes through both of them.
fr: Énoncé de l’axiome 1 de Huzita-Hatori : Étant donnés deux points P1 et P2, il existe un pli unique passant par ces deux points.

source: - Given a segment S divide it in N equal parts or - Given two lines L1 and L2 crossing point P, divide the salient angle (0-180°) between L1 and L2 in N equal angles.
fr: - Étant donné un segment S, le diviser en N parties égales ou - Étant données deux droites D1 et D2 sécantes en P, diviser l’angle saillant (0-180°) entre D1 et D2 en N angles égaux.

source: Rabbit-Ear
fr: Oreille de lapin
